package Easy;

public class Questions {

    /*
    * 1. Коллекции в Java - это контейнер, который позволяет хранить в себе разные элементы. Улучшенная и более практичная версия массивов.
    * 2. 3 основных интерфейса, которые наследуются от интерфейса Collection в java - это List, Set, Queue.
    * 3. ArrayList - это коллекция, которая хранит в себе элементы как массив, имеет индексы.
    * LinkedList - это коллекция, которая хранит данные в виде цепочки, каждый элемент знает своего соседа спереди и сзади.
    * 4. Коллекция, которая хранит только (!) уникальные элементы (не повторяющиеся).
    * HashSet - не упорядоченная коллекция, с уникальными элементами.
    * TreeSet - упорядоченная коллекция, с уникальными элементами.
    * LinkedHashSet - коллекция, которая хранит элементы в виде цепочки, с уникальными элементами.
    * 5. Связь между методами equals() и hashCode() в том что оба метода нужно переопределять при работе с коллекциями, для корректной работы.
    * Коллизия в коллекциях - это когда разные элементы имеют одинаковый ключ доступа, но разное содержание.
    * 6. Нет утверждение не истинно, так как если у двух объектов хеш-код равен - это значит, что они лежат в одной "корзине", но это совсем не обозначает, что обьекты равны.
    * 7. Ассоциативный массив в Java - это коллекция с реализацией ключ/объект.
    * HashMap - не упорядоченная коллекция, значения могут повторяться, но не ключи.
    * LinkedHashMap - коллекция, которая хранит элементы в виде цепочки, значения могут повторяться, но не ключи.
    * TreeMap - отсортированная коллекция, значения могут повторяться, но не ключи.
    * 8.
    */

}
